import java.util.*;
public class Main {
    public static void main(String[] args) {
        Order<String, Integer, Integer> x1= new Order<String, Integer, Integer>("Компьютер",17, 1);
        System.out.println(x1);
    }
    /*Создать обобщенный класс с тремя параметрами (T, V, K).Класс содержит три переменные
    типа (T, V, K), конструктор, принимающий на вход параметры типа (T, V, K), методы возвращающие
    значения трех переменных. Создать метод, выводящий на консоль имена классов для трех переменных класса.
     */

}
